MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4200-Q48F256/mcu.h
/* -------------------------------  USB_DVBUSPULSE  ------------------------------- */
#define USB_DVBUSPULSE_DVBUSPulse_Pos         (0UL)                     /*!< USB DVBUSPULSE: DVBUSPulse (Bit 0)                          */
#define USB_DVBUSPULSE_DVBUSPulse_Msk         (0xfffUL)                 /*!< USB DVBUSPULSE: DVBUSPulse (Bitfield-Mask: 0xfff)           */

/* -------------------------------  USB_DIEPEMPMSK  ------------------------------- */
#define USB_DIEPEMPMSK_InEpTxfEmpMsk_Pos      (0UL)                     /*!< USB DIEPEMPMSK: InEpTxfEmpMsk (Bit 0)                       */
#define USB_DIEPEMPMSK_InEpTxfEmpMsk_Msk      (0xffffUL)                /*!< USB DIEPEMPMSK: InEpTxfEmpMsk (Bitfield-Mask: 0xffff)       */

/* ---------------------------------  USB_PCGCCTL  -------------------------------- */
#define USB_PCGCCTL_StopPclk_Pos              (0UL)                     /*!< USB PCGCCTL: StopPclk (Bit 0)                               */
#define USB_PCGCCTL_StopPclk_Msk              (0x1UL)                   /*!< USB PCGCCTL: StopPclk (Bitfield-Mask: 0x01)                 */
#define USB_PCGCCTL_GateHclk_Pos              (1UL)                     /*!< USB PCGCCTL: GateHclk (Bit 1)                               */
#define USB_PCGCCTL_GateHclk_Msk              (0x2UL)                   /*!< USB PCGCCTL: GateHclk (Bitfield-Mask: 0x01)                 */


/* ================================================================================ */
/* ================        struct 'USB0_EP0' Position & Mask       ================ */
/* ================================================================================ */


/* ------------------------------  USB_EP_DIEPCTL0  ----------------------------- */
#define USB_EP_DIEPCTL0_MPS_Pos             (0UL)                     /*!< USB0_EP0 DIEPCTL0: MPS (Bit 0)                              */
#define USB_EP_DIEPCTL0_MPS_Msk             (0x3UL)                   /*!< USB0_EP0 DIEPCTL0: MPS (Bitfield-Mask: 0x03)                */
#define USB_EP_DIEPCTL0_USBActEP_Pos        (15UL)                    /*!< USB0_EP0 DIEPCTL0: USBActEP (Bit 15)                        */
#define USB_EP_DIEPCTL0_USBActEP_Msk        (0x8000UL)                /*!< USB0_EP0 DIEPCTL0: USBActEP (Bitfield-Mask: 0x01)           */
#define USB_EP_DIEPCTL0_NAKSts_Pos          (17UL)                    /*!< USB0_EP0 DIEPCTL0: NAKSts (Bit 17)                          */
#define USB_EP_DIEPCTL0_NAKSts_Msk          (0x20000UL)               /*!< USB0_EP0 DIEPCTL0: NAKSts (Bitfield-Mask: 0x01)             */
#define USB_EP_DIEPCTL0_EPType_Pos          (18UL)                    /*!< USB0_EP0 DIEPCTL0: EPType (Bit 18)                          */
#define USB_EP_DIEPCTL0_EPType_Msk          (0xc0000UL)               /*!< USB0_EP0 DIEPCTL0: EPType (Bitfield-Mask: 0x03)             */
#define USB_EP_DIEPCTL0_Stall_Pos           (21UL)                    /*!< USB0_EP0 DIEPCTL0: Stall (Bit 21)                           */
#define USB_EP_DIEPCTL0_Stall_Msk           (0x200000UL)              /*!< USB0_EP0 DIEPCTL0: Stall (Bitfield-Mask: 0x01)              */
#define USB_EP_DIEPCTL0_TxFNum_Pos          (22UL)                    /*!< USB0_EP0 DIEPCTL0: TxFNum (Bit 22)                          */
#define USB_EP_DIEPCTL0_TxFNum_Msk          (0x3c00000UL)             /*!< USB0_EP0 DIEPCTL0: TxFNum (Bitfield-Mask: 0x0f)             */
#define USB_EP_DIEPCTL0_CNAK_Pos            (26UL)                    /*!< USB0_EP0 DIEPCTL0: CNAK (Bit 26)                            */
#define USB_EP_DIEPCTL0_CNAK_Msk            (0x4000000UL)             /*!< USB0_EP0 DIEPCTL0: CNAK (Bitfield-Mask: 0x01)               */
#define USB_EP_DIEPCTL0_SNAK_Pos            (27UL)                    /*!< USB0_EP0 DIEPCTL0: SNAK (Bit 27)                            */
#define USB_EP_DIEPCTL0_SNAK_Msk            (0x8000000UL)             /*!< USB0_EP0 DIEPCTL0: SNAK (Bitfield-Mask: 0x01)               */
#define USB_EP_DIEPCTL0_EPDis_Pos           (30UL)                    /*!< USB0_EP0 DIEPCTL0: EPDis (Bit 30)                           */
#define USB_EP_DIEPCTL0_EPDis_Msk           (0x40000000UL)            /*!< USB0_EP0 DIEPCTL0: EPDis (Bitfield-Mask: 0x01)              */
#define USB_EP_DIEPCTL0_EPEna_Pos           (31UL)                    /*!< USB0_EP0 DIEPCTL0: EPEna (Bit 31)                           */
#define USB_EP_DIEPCTL0_EPEna_Msk           (0x80000000UL)            /*!< USB0_EP0 DIEPCTL0: EPEna (Bitfield-Mask: 0x01)              */

/* ------------------------------  USB_EP_DIEPINT0  ----------------------------- */
#define USB_EP_DIEPINT0_XferCompl_Pos       (0UL)                     /*!< USB0_EP0 DIEPINT0: XferCompl (Bit 0)                        */
#define USB_EP_DIEPINT0_XferCompl_Msk       (0x1UL)                   /*!< USB0_EP0 DIEPINT0: XferCompl (Bitfield-Mask: 0x01)          */
#define USB_EP_DIEPINT0_EPDisbld_Pos        (1UL)                     /*!< USB0_EP0 DIEPINT0: EPDisbld (Bit 1)                         */
#define USB_EP_DIEPINT0_EPDisbld_Msk        (0x2UL)                   /*!< USB0_EP0 DIEPINT0: EPDisbld (Bitfield-Mask: 0x01)           */
#define USB_EP_DIEPINT0_AHBErr_Pos          (2UL)                     /*!< USB0_EP0 DIEPINT0: AHBErr (Bit 2)                           */
#define USB_EP_DIEPINT0_AHBErr_Msk          (0x4UL)                   /*!< USB0_EP0 DIEPINT0: AHBErr (Bitfield-Mask: 0x01)             */
#define USB_EP_DIEPINT0_TimeOUT_Pos         (3UL)                     /*!< USB0_EP0 DIEPINT0: TimeOUT (Bit 3)                          */
#define USB_EP_DIEPINT0_TimeOUT_Msk         (0x8UL)                   /*!< USB0_EP0 DIEPINT0: TimeOUT (Bitfield-Mask: 0x01)            */
#define USB_EP_DIEPINT0_INTknTXFEmp_Pos     (4UL)                     /*!< USB0_EP0 DIEPINT0: INTknTXFEmp (Bit 4)                      */
#define USB_EP_DIEPINT0_INTknTXFEmp_Msk     (0x10UL)                  /*!< USB0_EP0 DIEPINT0: INTknTXFEmp (Bitfield-Mask: 0x01)        */
#define USB_EP_DIEPINT0_INEPNakEff_Pos      (6UL)                     /*!< USB0_EP0 DIEPINT0: INEPNakEff (Bit 6)                       */
#define USB_EP_DIEPINT0_INEPNakEff_Msk      (0x40UL)                  /*!< USB0_EP0 DIEPINT0: INEPNakEff (Bitfield-Mask: 0x01)         */
#define USB_EP_DIEPINT0_TxFEmp_Pos          (7UL)                     /*!< USB0_EP0 DIEPINT0: TxFEmp (Bit 7)                           */
#define USB_EP_DIEPINT0_TxFEmp_Msk          (0x80UL)                  /*!< USB0_EP0 DIEPINT0: TxFEmp (Bitfield-Mask: 0x01)             */
#define USB_EP_DIEPINT0_BNAIntr_Pos         (9UL)                     /*!< USB0_EP0 DIEPINT0: BNAIntr (Bit 9)                          */
#define USB_EP_DIEPINT0_BNAIntr_Msk         (0x200UL)                 /*!< USB0_EP0 DIEPINT0: BNAIntr (Bitfield-Mask: 0x01)            */

/* -----------------------------  USB_EP_DIEPTSIZ0  ----------------------------- */
#define USB_EP_DIEPTSIZ0_XferSize_Pos       (0UL)                     /*!< USB0_EP0 DIEPTSIZ0: XferSize (Bit 0)                        */
#define USB_EP_DIEPTSIZ0_XferSize_Msk       (0x7fUL)                  /*!< USB0_EP0 DIEPTSIZ0: XferSize (Bitfield-Mask: 0x7f)          */
#define USB_EP_DIEPTSIZ0_PktCnt_Pos         (19UL)                    /*!< USB0_EP0 DIEPTSIZ0: PktCnt (Bit 19)                         */
#define USB_EP_DIEPTSIZ0_PktCnt_Msk         (0x180000UL)              /*!< USB0_EP0 DIEPTSIZ0: PktCnt (Bitfield-Mask: 0x03)            */

/* ------------------------------  USB_EP_DIEPDMA0  ----------------------------- */
#define USB_EP_DIEPDMA0_DMAAddr_Pos         (0UL)                     /*!< USB0_EP0 DIEPDMA0: DMAAddr (Bit 0)                          */
#define USB_EP_DIEPDMA0_DMAAddr_Msk         (0xffffffffUL)            /*!< USB0_EP0 DIEPDMA0: DMAAddr (Bitfield-Mask: 0xffffffff)      */

/* ------------------------------  USB_EP_DTXFSTS0  ----------------------------- */
#define USB_EP_DTXFSTS0_INEPTxFSpcAvail_Pos (0UL)                     /*!< USB0_EP0 DTXFSTS0: INEPTxFSpcAvail (Bit 0)                  */
#define USB_EP_DTXFSTS0_INEPTxFSpcAvail_Msk (0xffffUL)                /*!< USB0_EP0 DTXFSTS0: INEPTxFSpcAvail (Bitfield-Mask: 0xffff)  */

/* -----------------------------  USB_EP_DIEPDMAB0  ----------------------------- */
#define USB_EP_DIEPDMAB0_DMABufferAddr_Pos  (0UL)                     /*!< USB0_EP0 DIEPDMAB0: DMABufferAddr (Bit 0)                   */
#define USB_EP_DIEPDMAB0_DMABufferAddr_Msk  (0xffffffffUL)            /*!< USB0_EP0 DIEPDMAB0: DMABufferAddr (Bitfield-Mask: 0xffffffff) */

/* ------------------------------  USB_EP_DOEPCTL0  ----------------------------- */
#define USB_EP_DOEPCTL0_MPS_Pos             (0UL)                     /*!< USB0_EP0 DOEPCTL0: MPS (Bit 0)                              */
#define USB_EP_DOEPCTL0_MPS_Msk             (0x3UL)                   /*!< USB0_EP0 DOEPCTL0: MPS (Bitfield-Mask: 0x03)                */
#define USB_EP_DOEPCTL0_USBActEP_Pos        (15UL)                    /*!< USB0_EP0 DOEPCTL0: USBActEP (Bit 15)                        */
#define USB_EP_DOEPCTL0_USBActEP_Msk        (0x8000UL)                /*!< USB0_EP0 DOEPCTL0: USBActEP (Bitfield-Mask: 0x01)           */
#define USB_EP_DOEPCTL0_NAKSts_Pos          (17UL)                    /*!< USB0_EP0 DOEPCTL0: NAKSts (Bit 17)                          */
#define USB_EP_DOEPCTL0_NAKSts_Msk          (0x20000UL)               /*!< USB0_EP0 DOEPCTL0: NAKSts (Bitfield-Mask: 0x01)             */
#define USB_EP_DOEPCTL0_EPType_Pos          (18UL)                    /*!< USB0_EP0 DOEPCTL0: EPType (Bit 18)                          */
#define USB_EP_DOEPCTL0_EPType_Msk          (0xc0000UL)               /*!< USB0_EP0 DOEPCTL0: EPType (Bitfield-Mask: 0x03)             */
#define USB_EP_DOEPCTL0_Snp_Pos             (20UL)                    /*!< USB0_EP0 DOEPCTL0: Snp (Bit 20)                             */
#define USB_EP_DOEPCTL0_Snp_Msk             (0x100000UL)              /*!< USB0_EP0 DOEPCTL0: Snp (Bitfield-Mask: 0x01)                */
#define USB_EP_DOEPCTL0_Stall_Pos           (21UL)                    /*!< USB0_EP0 DOEPCTL0: Stall (Bit 21)                           */
#define USB_EP_DOEPCTL0_Stall_Msk           (0x200000UL)              /*!< USB0_EP0 DOEPCTL0: Stall (Bitfield-Mask: 0x01)              */
#define USB_EP_DOEPCTL0_CNAK_Pos            (26UL)                    /*!< USB0_EP0 DOEPCTL0: CNAK (Bit 26)                            */
#define USB_EP_DOEPCTL0_CNAK_Msk            (0x4000000UL)             /*!< USB0_EP0 DOEPCTL0: CNAK (Bitfield-Mask: 0x01)               */
#define USB_EP_DOEPCTL0_SNAK_Pos            (27UL)                    /*!< USB0_EP0 DOEPCTL0: SNAK (Bit 27)                            */
#define USB_EP_DOEPCTL0_SNAK_Msk            (0x8000000UL)             /*!< USB0_EP0 DOEPCTL0: SNAK (Bitfield-Mask: 0x01)               */
#define USB_EP_DOEPCTL0_EPDis_Pos           (30UL)                    /*!< USB0_EP0 DOEPCTL0: EPDis (Bit 30)                           */
#define USB_EP_DOEPCTL0_EPDis_Msk           (0x40000000UL)            /*!< USB0_EP0 DOEPCTL0: EPDis (Bitfield-Mask: 0x01)              */
#define USB_EP_DOEPCTL0_EPEna_Pos           (31UL)                    /*!< USB0_EP0 DOEPCTL0: EPEna (Bit 31)                           */
#define USB_EP_DOEPCTL0_EPEna_Msk           (0x80000000UL)            /*!< USB0_EP0 DOEPCTL0: EPEna (Bitfield-Mask: 0x01)              */

/* ------------------------------  USB_EP_DOEPINT0  ----------------------------- */
#define USB_EP_DOEPINT0_XferCompl_Pos       (0UL)                     /*!< USB0_EP0 DOEPINT0: XferCompl (Bit 0)                        */
#define USB_EP_DOEPINT0_XferCompl_Msk       (0x1UL)                   /*!< USB0_EP0 DOEPINT0: XferCompl (Bitfield-Mask: 0x01)          */
#define USB_EP_DOEPINT0_EPDisbld_Pos        (1UL)                     /*!< USB0_EP0 DOEPINT0: EPDisbld (Bit 1)                         */
#define USB_EP_DOEPINT0_EPDisbld_Msk        (0x2UL)                   /*!< USB0_EP0 DOEPINT0: EPDisbld (Bitfield-Mask: 0x01)           */
#define USB_EP_DOEPINT0_AHBErr_Pos          (2UL)                     /*!< USB0_EP0 DOEPINT0: AHBErr (Bit 2)                           */
#define USB_EP_DOEPINT0_AHBErr_Msk          (0x4UL)                   /*!< USB0_EP0 DOEPINT0: AHBErr (Bitfield-Mask: 0x01)             */
#define USB_EP_DOEPINT0_SetUp_Pos           (3UL)                     /*!< USB0_EP0 DOEPINT0: SetUp (Bit 3)                            */
#define USB_EP_DOEPINT0_SetUp_Msk           (0x8UL)                   /*!< USB0_EP0 DOEPINT0: SetUp (Bitfield-Mask: 0x01)              */
#define USB_EP_DOEPINT0_OUTTknEPdis_Pos     (4UL)                     /*!< USB0_EP0 DOEPINT0: OUTTknEPdis (Bit 4)                      */
#define USB_EP_DOEPINT0_OUTTknEPdis_Msk     (0x10UL)                  /*!< USB0_EP0 DOEPINT0: OUTTknEPdis (Bitfield-Mask: 0x01)        */
#define USB_EP_DOEPINT0_StsPhseRcvd_Pos     (5UL)                     /*!< USB0_EP0 DOEPINT0: StsPhseRcvd (Bit 5)                      */
#define USB_EP_DOEPINT0_StsPhseRcvd_Msk     (0x20UL)                  /*!< USB0_EP0 DOEPINT0: StsPhseRcvd (Bitfield-Mask: 0x01)        */
#define USB_EP_DOEPINT0_Back2BackSETup_Pos  (6UL)                     /*!< USB0_EP0 DOEPINT0: Back2BackSETup (Bit 6)                   */
#define USB_EP_DOEPINT0_Back2BackSETup_Msk  (0x40UL)                  /*!< USB0_EP0 DOEPINT0: Back2BackSETup (Bitfield-Mask: 0x01)     */
#define USB_EP_DOEPINT0_BNAIntr_Pos         (9UL)                     /*!< USB0_EP0 DOEPINT0: BNAIntr (Bit 9)                          */
#define USB_EP_DOEPINT0_BNAIntr_Msk         (0x200UL)                 /*!< USB0_EP0 DOEPINT0: BNAIntr (Bitfield-Mask: 0x01)            */
#define USB_EP_DOEPINT0_PktDrpSts_Pos       (11UL)                    /*!< USB0_EP0 DOEPINT0: PktDrpSts (Bit 11)                       */
#define USB_EP_DOEPINT0_PktDrpSts_Msk       (0x800UL)                 /*!< USB0_EP0 DOEPINT0: PktDrpSts (Bitfield-Mask: 0x01)          */
#define USB_EP_DOEPINT0_BbleErrIntrpt_Pos   (12UL)                    /*!< USB0_EP0 DOEPINT0: BbleErrIntrpt (Bit 12)                   */
#define USB_EP_DOEPINT0_BbleErrIntrpt_Msk   (0x1000UL)                /*!< USB0_EP0 DOEPINT0: BbleErrIntrpt (Bitfield-Mask: 0x01)      */
#define USB_EP_DOEPINT0_NAKIntrpt_Pos       (13UL)                    /*!< USB0_EP0 DOEPINT0: NAKIntrpt (Bit 13)                       */
#define USB_EP_DOEPINT0_NAKIntrpt_Msk       (0x2000UL)                /*!< USB0_EP0 DOEPINT0: NAKIntrpt (Bitfield-Mask: 0x01)          */
#define USB_EP_DOEPINT0_NYETIntrpt_Pos      (14UL)                    /*!< USB0_EP0 DOEPINT0: NYETIntrpt (Bit 14)                      */
#define USB_EP_DOEPINT0_NYETIntrpt_Msk      (0x4000UL)                /*!< USB0_EP0 DOEPINT0: NYETIntrpt (Bitfield-Mask: 0x01)         */

