MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4200-Q48F256/mcu.h
/* --------------------------------  DAC_DAC1CFG1  -------------------------------- */
#define DAC_DAC1CFG1_SCALE_Pos                (0UL)                     /*!< DAC DAC1CFG1: SCALE (Bit 0)                                 */
#define DAC_DAC1CFG1_SCALE_Msk                (0x7UL)                   /*!< DAC DAC1CFG1: SCALE (Bitfield-Mask: 0x07)                   */
#define DAC_DAC1CFG1_MULDIV_Pos               (3UL)                     /*!< DAC DAC1CFG1: MULDIV (Bit 3)                                */
#define DAC_DAC1CFG1_MULDIV_Msk               (0x8UL)                   /*!< DAC DAC1CFG1: MULDIV (Bitfield-Mask: 0x01)                  */
#define DAC_DAC1CFG1_OFFS_Pos                 (4UL)                     /*!< DAC DAC1CFG1: OFFS (Bit 4)                                  */
#define DAC_DAC1CFG1_OFFS_Msk                 (0xff0UL)                 /*!< DAC DAC1CFG1: OFFS (Bitfield-Mask: 0xff)                    */
#define DAC_DAC1CFG1_TRIGSEL_Pos              (12UL)                    /*!< DAC DAC1CFG1: TRIGSEL (Bit 12)                              */
#define DAC_DAC1CFG1_TRIGSEL_Msk              (0x7000UL)                /*!< DAC DAC1CFG1: TRIGSEL (Bitfield-Mask: 0x07)                 */
#define DAC_DAC1CFG1_SWTRIG_Pos               (16UL)                    /*!< DAC DAC1CFG1: SWTRIG (Bit 16)                               */
#define DAC_DAC1CFG1_SWTRIG_Msk               (0x10000UL)               /*!< DAC DAC1CFG1: SWTRIG (Bitfield-Mask: 0x01)                  */
#define DAC_DAC1CFG1_TRIGMOD_Pos              (17UL)                    /*!< DAC DAC1CFG1: TRIGMOD (Bit 17)                              */
#define DAC_DAC1CFG1_TRIGMOD_Msk              (0x60000UL)               /*!< DAC DAC1CFG1: TRIGMOD (Bitfield-Mask: 0x03)                 */
#define DAC_DAC1CFG1_ANACFG_Pos               (19UL)                    /*!< DAC DAC1CFG1: ANACFG (Bit 19)                               */
#define DAC_DAC1CFG1_ANACFG_Msk               (0xf80000UL)              /*!< DAC DAC1CFG1: ANACFG (Bitfield-Mask: 0x1f)                  */
#define DAC_DAC1CFG1_ANAEN_Pos                (24UL)                    /*!< DAC DAC1CFG1: ANAEN (Bit 24)                                */
#define DAC_DAC1CFG1_ANAEN_Msk                (0x1000000UL)             /*!< DAC DAC1CFG1: ANAEN (Bitfield-Mask: 0x01)                   */
#define DAC_DAC1CFG1_REFCFGH_Pos              (28UL)                    /*!< DAC DAC1CFG1: REFCFGH (Bit 28)                              */
#define DAC_DAC1CFG1_REFCFGH_Msk              (0xf0000000UL)            /*!< DAC DAC1CFG1: REFCFGH (Bitfield-Mask: 0x0f)                 */

/* --------------------------------  DAC_DAC0DATA  -------------------------------- */
#define DAC_DAC0DATA_DATA0_Pos                (0UL)                     /*!< DAC DAC0DATA: DATA0 (Bit 0)                                 */
#define DAC_DAC0DATA_DATA0_Msk                (0xfffUL)                 /*!< DAC DAC0DATA: DATA0 (Bitfield-Mask: 0xfff)                  */

/* --------------------------------  DAC_DAC1DATA  -------------------------------- */
#define DAC_DAC1DATA_DATA1_Pos                (0UL)                     /*!< DAC DAC1DATA: DATA1 (Bit 0)                                 */
#define DAC_DAC1DATA_DATA1_Msk                (0xfffUL)                 /*!< DAC DAC1DATA: DATA1 (Bitfield-Mask: 0xfff)                  */

/* --------------------------------  DAC_DAC01DATA  ------------------------------- */
#define DAC_DAC01DATA_DATA0_Pos               (0UL)                     /*!< DAC DAC01DATA: DATA0 (Bit 0)                                */
#define DAC_DAC01DATA_DATA0_Msk               (0xfffUL)                 /*!< DAC DAC01DATA: DATA0 (Bitfield-Mask: 0xfff)                 */
#define DAC_DAC01DATA_DATA1_Pos               (16UL)                    /*!< DAC DAC01DATA: DATA1 (Bit 16)                               */
#define DAC_DAC01DATA_DATA1_Msk               (0xfff0000UL)             /*!< DAC DAC01DATA: DATA1 (Bitfield-Mask: 0xfff)                 */

/* --------------------------------  DAC_DAC0PATL  -------------------------------- */
#define DAC_DAC0PATL_PAT0_Pos                 (0UL)                     /*!< DAC DAC0PATL: PAT0 (Bit 0)                                  */
#define DAC_DAC0PATL_PAT0_Msk                 (0x1fUL)                  /*!< DAC DAC0PATL: PAT0 (Bitfield-Mask: 0x1f)                    */
#define DAC_DAC0PATL_PAT1_Pos                 (5UL)                     /*!< DAC DAC0PATL: PAT1 (Bit 5)                                  */
#define DAC_DAC0PATL_PAT1_Msk                 (0x3e0UL)                 /*!< DAC DAC0PATL: PAT1 (Bitfield-Mask: 0x1f)                    */
#define DAC_DAC0PATL_PAT2_Pos                 (10UL)                    /*!< DAC DAC0PATL: PAT2 (Bit 10)                                 */
#define DAC_DAC0PATL_PAT2_Msk                 (0x7c00UL)                /*!< DAC DAC0PATL: PAT2 (Bitfield-Mask: 0x1f)                    */
#define DAC_DAC0PATL_PAT3_Pos                 (15UL)                    /*!< DAC DAC0PATL: PAT3 (Bit 15)                                 */
#define DAC_DAC0PATL_PAT3_Msk                 (0xf8000UL)               /*!< DAC DAC0PATL: PAT3 (Bitfield-Mask: 0x1f)                    */
#define DAC_DAC0PATL_PAT4_Pos                 (20UL)                    /*!< DAC DAC0PATL: PAT4 (Bit 20)                                 */
#define DAC_DAC0PATL_PAT4_Msk                 (0x1f00000UL)             /*!< DAC DAC0PATL: PAT4 (Bitfield-Mask: 0x1f)                    */
#define DAC_DAC0PATL_PAT5_Pos                 (25UL)                    /*!< DAC DAC0PATL: PAT5 (Bit 25)                                 */
#define DAC_DAC0PATL_PAT5_Msk                 (0x3e000000UL)            /*!< DAC DAC0PATL: PAT5 (Bitfield-Mask: 0x1f)                    */

/* --------------------------------  DAC_DAC0PATH  -------------------------------- */
#define DAC_DAC0PATH_PAT6_Pos                 (0UL)                     /*!< DAC DAC0PATH: PAT6 (Bit 0)                                  */
#define DAC_DAC0PATH_PAT6_Msk                 (0x1fUL)                  /*!< DAC DAC0PATH: PAT6 (Bitfield-Mask: 0x1f)                    */
#define DAC_DAC0PATH_PAT7_Pos                 (5UL)                     /*!< DAC DAC0PATH: PAT7 (Bit 5)                                  */
#define DAC_DAC0PATH_PAT7_Msk                 (0x3e0UL)                 /*!< DAC DAC0PATH: PAT7 (Bitfield-Mask: 0x1f)                    */
#define DAC_DAC0PATH_PAT8_Pos                 (10UL)                    /*!< DAC DAC0PATH: PAT8 (Bit 10)                                 */
#define DAC_DAC0PATH_PAT8_Msk                 (0x7c00UL)                /*!< DAC DAC0PATH: PAT8 (Bitfield-Mask: 0x1f)                    */

/* --------------------------------  DAC_DAC1PATL  -------------------------------- */
#define DAC_DAC1PATL_PAT0_Pos                 (0UL)                     /*!< DAC DAC1PATL: PAT0 (Bit 0)                                  */
#define DAC_DAC1PATL_PAT0_Msk                 (0x1fUL)                  /*!< DAC DAC1PATL: PAT0 (Bitfield-Mask: 0x1f)                    */
#define DAC_DAC1PATL_PAT1_Pos                 (5UL)                     /*!< DAC DAC1PATL: PAT1 (Bit 5)                                  */
#define DAC_DAC1PATL_PAT1_Msk                 (0x3e0UL)                 /*!< DAC DAC1PATL: PAT1 (Bitfield-Mask: 0x1f)                    */
#define DAC_DAC1PATL_PAT2_Pos                 (10UL)                    /*!< DAC DAC1PATL: PAT2 (Bit 10)                                 */
#define DAC_DAC1PATL_PAT2_Msk                 (0x7c00UL)                /*!< DAC DAC1PATL: PAT2 (Bitfield-Mask: 0x1f)                    */
#define DAC_DAC1PATL_PAT3_Pos                 (15UL)                    /*!< DAC DAC1PATL: PAT3 (Bit 15)                                 */
#define DAC_DAC1PATL_PAT3_Msk                 (0xf8000UL)               /*!< DAC DAC1PATL: PAT3 (Bitfield-Mask: 0x1f)                    */
#define DAC_DAC1PATL_PAT4_Pos                 (20UL)                    /*!< DAC DAC1PATL: PAT4 (Bit 20)                                 */
#define DAC_DAC1PATL_PAT4_Msk                 (0x1f00000UL)             /*!< DAC DAC1PATL: PAT4 (Bitfield-Mask: 0x1f)                    */
#define DAC_DAC1PATL_PAT5_Pos                 (25UL)                    /*!< DAC DAC1PATL: PAT5 (Bit 25)                                 */
#define DAC_DAC1PATL_PAT5_Msk                 (0x3e000000UL)            /*!< DAC DAC1PATL: PAT5 (Bitfield-Mask: 0x1f)                    */

/* --------------------------------  DAC_DAC1PATH  -------------------------------- */
#define DAC_DAC1PATH_PAT6_Pos                 (0UL)                     /*!< DAC DAC1PATH: PAT6 (Bit 0)                                  */
#define DAC_DAC1PATH_PAT6_Msk                 (0x1fUL)                  /*!< DAC DAC1PATH: PAT6 (Bitfield-Mask: 0x1f)                    */
#define DAC_DAC1PATH_PAT7_Pos                 (5UL)                     /*!< DAC DAC1PATH: PAT7 (Bit 5)                                  */
#define DAC_DAC1PATH_PAT7_Msk                 (0x3e0UL)                 /*!< DAC DAC1PATH: PAT7 (Bitfield-Mask: 0x1f)                    */
#define DAC_DAC1PATH_PAT8_Pos                 (10UL)                    /*!< DAC DAC1PATH: PAT8 (Bit 10)                                 */
#define DAC_DAC1PATH_PAT8_Msk                 (0x7c00UL)                /*!< DAC DAC1PATH: PAT8 (Bitfield-Mask: 0x1f)                    */


/* ================================================================================ */
/* ================          Group 'CCU4' Position & Mask          ================ */
/* ================================================================================ */


/* ---------------------------------  CCU4_GCTRL  --------------------------------- */
#define CCU4_GCTRL_PRBC_Pos                   (0UL)                     /*!< CCU4 GCTRL: PRBC (Bit 0)                                    */
#define CCU4_GCTRL_PRBC_Msk                   (0x7UL)                   /*!< CCU4 GCTRL: PRBC (Bitfield-Mask: 0x07)                      */
#define CCU4_GCTRL_PCIS_Pos                   (4UL)                     /*!< CCU4 GCTRL: PCIS (Bit 4)                                    */
#define CCU4_GCTRL_PCIS_Msk                   (0x30UL)                  /*!< CCU4 GCTRL: PCIS (Bitfield-Mask: 0x03)                      */
#define CCU4_GCTRL_SUSCFG_Pos                 (8UL)                     /*!< CCU4 GCTRL: SUSCFG (Bit 8)                                  */
#define CCU4_GCTRL_SUSCFG_Msk                 (0x300UL)                 /*!< CCU4 GCTRL: SUSCFG (Bitfield-Mask: 0x03)                    */
#define CCU4_GCTRL_MSE0_Pos                   (10UL)                    /*!< CCU4 GCTRL: MSE0 (Bit 10)                                   */
#define CCU4_GCTRL_MSE0_Msk                   (0x400UL)                 /*!< CCU4 GCTRL: MSE0 (Bitfield-Mask: 0x01)                      */
#define CCU4_GCTRL_MSE1_Pos                   (11UL)                    /*!< CCU4 GCTRL: MSE1 (Bit 11)                                   */
#define CCU4_GCTRL_MSE1_Msk                   (0x800UL)                 /*!< CCU4 GCTRL: MSE1 (Bitfield-Mask: 0x01)                      */
#define CCU4_GCTRL_MSE2_Pos                   (12UL)                    /*!< CCU4 GCTRL: MSE2 (Bit 12)                                   */
#define CCU4_GCTRL_MSE2_Msk                   (0x1000UL)                /*!< CCU4 GCTRL: MSE2 (Bitfield-Mask: 0x01)                      */
#define CCU4_GCTRL_MSE3_Pos                   (13UL)                    /*!< CCU4 GCTRL: MSE3 (Bit 13)                                   */
#define CCU4_GCTRL_MSE3_Msk                   (0x2000UL)                /*!< CCU4 GCTRL: MSE3 (Bitfield-Mask: 0x01)                      */
#define CCU4_GCTRL_MSDE_Pos                   (14UL)                    /*!< CCU4 GCTRL: MSDE (Bit 14)                                   */
#define CCU4_GCTRL_MSDE_Msk                   (0xc000UL)                /*!< CCU4 GCTRL: MSDE (Bitfield-Mask: 0x03)                      */

/* ---------------------------------  CCU4_GSTAT  --------------------------------- */
#define CCU4_GSTAT_S0I_Pos                    (0UL)                     /*!< CCU4 GSTAT: S0I (Bit 0)                                     */
#define CCU4_GSTAT_S0I_Msk                    (0x1UL)                   /*!< CCU4 GSTAT: S0I (Bitfield-Mask: 0x01)                       */
#define CCU4_GSTAT_S1I_Pos                    (1UL)                     /*!< CCU4 GSTAT: S1I (Bit 1)                                     */
#define CCU4_GSTAT_S1I_Msk                    (0x2UL)                   /*!< CCU4 GSTAT: S1I (Bitfield-Mask: 0x01)                       */
#define CCU4_GSTAT_S2I_Pos                    (2UL)                     /*!< CCU4 GSTAT: S2I (Bit 2)                                     */
#define CCU4_GSTAT_S2I_Msk                    (0x4UL)                   /*!< CCU4 GSTAT: S2I (Bitfield-Mask: 0x01)                       */
#define CCU4_GSTAT_S3I_Pos                    (3UL)                     /*!< CCU4 GSTAT: S3I (Bit 3)                                     */
#define CCU4_GSTAT_S3I_Msk                    (0x8UL)                   /*!< CCU4 GSTAT: S3I (Bitfield-Mask: 0x01)                       */
#define CCU4_GSTAT_PRB_Pos                    (8UL)                     /*!< CCU4 GSTAT: PRB (Bit 8)                                     */
#define CCU4_GSTAT_PRB_Msk                    (0x100UL)                 /*!< CCU4 GSTAT: PRB (Bitfield-Mask: 0x01)                       */

/* ---------------------------------  CCU4_GIDLS  --------------------------------- */
#define CCU4_GIDLS_SS0I_Pos                   (0UL)                     /*!< CCU4 GIDLS: SS0I (Bit 0)                                    */
#define CCU4_GIDLS_SS0I_Msk                   (0x1UL)                   /*!< CCU4 GIDLS: SS0I (Bitfield-Mask: 0x01)                      */
#define CCU4_GIDLS_SS1I_Pos                   (1UL)                     /*!< CCU4 GIDLS: SS1I (Bit 1)                                    */
#define CCU4_GIDLS_SS1I_Msk                   (0x2UL)                   /*!< CCU4 GIDLS: SS1I (Bitfield-Mask: 0x01)                      */
#define CCU4_GIDLS_SS2I_Pos                   (2UL)                     /*!< CCU4 GIDLS: SS2I (Bit 2)                                    */
#define CCU4_GIDLS_SS2I_Msk                   (0x4UL)                   /*!< CCU4 GIDLS: SS2I (Bitfield-Mask: 0x01)                      */
#define CCU4_GIDLS_SS3I_Pos                   (3UL)                     /*!< CCU4 GIDLS: SS3I (Bit 3)                                    */
#define CCU4_GIDLS_SS3I_Msk                   (0x8UL)                   /*!< CCU4 GIDLS: SS3I (Bitfield-Mask: 0x01)                      */
#define CCU4_GIDLS_CPRB_Pos                   (8UL)                     /*!< CCU4 GIDLS: CPRB (Bit 8)                                    */
#define CCU4_GIDLS_CPRB_Msk                   (0x100UL)                 /*!< CCU4 GIDLS: CPRB (Bitfield-Mask: 0x01)                      */
#define CCU4_GIDLS_PSIC_Pos                   (9UL)                     /*!< CCU4 GIDLS: PSIC (Bit 9)                                    */
#define CCU4_GIDLS_PSIC_Msk                   (0x200UL)                 /*!< CCU4 GIDLS: PSIC (Bitfield-Mask: 0x01)                      */

/* ---------------------------------  CCU4_GIDLC  --------------------------------- */
#define CCU4_GIDLC_CS0I_Pos                   (0UL)                     /*!< CCU4 GIDLC: CS0I (Bit 0)                                    */
#define CCU4_GIDLC_CS0I_Msk                   (0x1UL)                   /*!< CCU4 GIDLC: CS0I (Bitfield-Mask: 0x01)                      */
#define CCU4_GIDLC_CS1I_Pos                   (1UL)                     /*!< CCU4 GIDLC: CS1I (Bit 1)                                    */
#define CCU4_GIDLC_CS1I_Msk                   (0x2UL)                   /*!< CCU4 GIDLC: CS1I (Bitfield-Mask: 0x01)                      */
#define CCU4_GIDLC_CS2I_Pos                   (2UL)                     /*!< CCU4 GIDLC: CS2I (Bit 2)                                    */
#define CCU4_GIDLC_CS2I_Msk                   (0x4UL)                   /*!< CCU4 GIDLC: CS2I (Bitfield-Mask: 0x01)                      */
#define CCU4_GIDLC_CS3I_Pos                   (3UL)                     /*!< CCU4 GIDLC: CS3I (Bit 3)                                    */
#define CCU4_GIDLC_CS3I_Msk                   (0x8UL)                   /*!< CCU4 GIDLC: CS3I (Bitfield-Mask: 0x01)                      */
#define CCU4_GIDLC_SPRB_Pos                   (8UL)                     /*!< CCU4 GIDLC: SPRB (Bit 8)                                    */
#define CCU4_GIDLC_SPRB_Msk                   (0x100UL)                 /*!< CCU4 GIDLC: SPRB (Bitfield-Mask: 0x01)                      */

/* ----------------------------------  CCU4_GCSS  --------------------------------- */
#define CCU4_GCSS_S0SE_Pos                    (0UL)                     /*!< CCU4 GCSS: S0SE (Bit 0)                                     */
#define CCU4_GCSS_S0SE_Msk                    (0x1UL)                   /*!< CCU4 GCSS: S0SE (Bitfield-Mask: 0x01)                       */
#define CCU4_GCSS_S0DSE_Pos                   (1UL)                     /*!< CCU4 GCSS: S0DSE (Bit 1)                                    */
#define CCU4_GCSS_S0DSE_Msk                   (0x2UL)                   /*!< CCU4 GCSS: S0DSE (Bitfield-Mask: 0x01)                      */
#define CCU4_GCSS_S0PSE_Pos                   (2UL)                     /*!< CCU4 GCSS: S0PSE (Bit 2)                                    */
#define CCU4_GCSS_S0PSE_Msk                   (0x4UL)                   /*!< CCU4 GCSS: S0PSE (Bitfield-Mask: 0x01)                      */
#define CCU4_GCSS_S1SE_Pos                    (4UL)                     /*!< CCU4 GCSS: S1SE (Bit 4)                                     */
#define CCU4_GCSS_S1SE_Msk                    (0x10UL)                  /*!< CCU4 GCSS: S1SE (Bitfield-Mask: 0x01)                       */
#define CCU4_GCSS_S1DSE_Pos                   (5UL)                     /*!< CCU4 GCSS: S1DSE (Bit 5)                                    */
#define CCU4_GCSS_S1DSE_Msk                   (0x20UL)                  /*!< CCU4 GCSS: S1DSE (Bitfield-Mask: 0x01)                      */
#define CCU4_GCSS_S1PSE_Pos                   (6UL)                     /*!< CCU4 GCSS: S1PSE (Bit 6)                                    */
#define CCU4_GCSS_S1PSE_Msk                   (0x40UL)                  /*!< CCU4 GCSS: S1PSE (Bitfield-Mask: 0x01)                      */
#define CCU4_GCSS_S2SE_Pos                    (8UL)                     /*!< CCU4 GCSS: S2SE (Bit 8)                                     */
#define CCU4_GCSS_S2SE_Msk                    (0x100UL)                 /*!< CCU4 GCSS: S2SE (Bitfield-Mask: 0x01)                       */
#define CCU4_GCSS_S2DSE_Pos                   (9UL)                     /*!< CCU4 GCSS: S2DSE (Bit 9)                                    */
#define CCU4_GCSS_S2DSE_Msk                   (0x200UL)                 /*!< CCU4 GCSS: S2DSE (Bitfield-Mask: 0x01)                      */
#define CCU4_GCSS_S2PSE_Pos                   (10UL)                    /*!< CCU4 GCSS: S2PSE (Bit 10)                                   */
#define CCU4_GCSS_S2PSE_Msk                   (0x400UL)                 /*!< CCU4 GCSS: S2PSE (Bitfield-Mask: 0x01)                      */
#define CCU4_GCSS_S3SE_Pos                    (12UL)                    /*!< CCU4 GCSS: S3SE (Bit 12)                                    */
#define CCU4_GCSS_S3SE_Msk                    (0x1000UL)                /*!< CCU4 GCSS: S3SE (Bitfield-Mask: 0x01)                       */
#define CCU4_GCSS_S3DSE_Pos                   (13UL)                    /*!< CCU4 GCSS: S3DSE (Bit 13)                                   */
#define CCU4_GCSS_S3DSE_Msk                   (0x2000UL)                /*!< CCU4 GCSS: S3DSE (Bitfield-Mask: 0x01)                      */
#define CCU4_GCSS_S3PSE_Pos                   (14UL)                    /*!< CCU4 GCSS: S3PSE (Bit 14)                                   */
#define CCU4_GCSS_S3PSE_Msk                   (0x4000UL)                /*!< CCU4 GCSS: S3PSE (Bitfield-Mask: 0x01)                      */
#define CCU4_GCSS_S0STS_Pos                   (16UL)                    /*!< CCU4 GCSS: S0STS (Bit 16)                                   */
#define CCU4_GCSS_S0STS_Msk                   (0x10000UL)               /*!< CCU4 GCSS: S0STS (Bitfield-Mask: 0x01)                      */
#define CCU4_GCSS_S1STS_Pos                   (17UL)                    /*!< CCU4 GCSS: S1STS (Bit 17)                                   */
#define CCU4_GCSS_S1STS_Msk                   (0x20000UL)               /*!< CCU4 GCSS: S1STS (Bitfield-Mask: 0x01)                      */
#define CCU4_GCSS_S2STS_Pos                   (18UL)                    /*!< CCU4 GCSS: S2STS (Bit 18)                                   */
#define CCU4_GCSS_S2STS_Msk                   (0x40000UL)               /*!< CCU4 GCSS: S2STS (Bitfield-Mask: 0x01)                      */
#define CCU4_GCSS_S3STS_Pos                   (19UL)                    /*!< CCU4 GCSS: S3STS (Bit 19)                                   */
#define CCU4_GCSS_S3STS_Msk                   (0x80000UL)               /*!< CCU4 GCSS: S3STS (Bitfield-Mask: 0x01)                      */

