MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC4200-Q48F256/mcu.h
/* ------------------------------  HRPWM0_CSG2_ISTAT  ----------------------------- */
#define HRPWM0_CSG2_ISTAT_VLS1S_Pos           (0UL)                     /*!< HRPWM0_CSG2 ISTAT: VLS1S (Bit 0)                            */
#define HRPWM0_CSG2_ISTAT_VLS1S_Msk           (0x1UL)                   /*!< HRPWM0_CSG2 ISTAT: VLS1S (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG2_ISTAT_VLS2S_Pos           (1UL)                     /*!< HRPWM0_CSG2 ISTAT: VLS2S (Bit 1)                            */
#define HRPWM0_CSG2_ISTAT_VLS2S_Msk           (0x2UL)                   /*!< HRPWM0_CSG2 ISTAT: VLS2S (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG2_ISTAT_TRGSS_Pos           (2UL)                     /*!< HRPWM0_CSG2 ISTAT: TRGSS (Bit 2)                            */
#define HRPWM0_CSG2_ISTAT_TRGSS_Msk           (0x4UL)                   /*!< HRPWM0_CSG2 ISTAT: TRGSS (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG2_ISTAT_STRSS_Pos           (3UL)                     /*!< HRPWM0_CSG2 ISTAT: STRSS (Bit 3)                            */
#define HRPWM0_CSG2_ISTAT_STRSS_Msk           (0x8UL)                   /*!< HRPWM0_CSG2 ISTAT: STRSS (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG2_ISTAT_STPSS_Pos           (4UL)                     /*!< HRPWM0_CSG2 ISTAT: STPSS (Bit 4)                            */
#define HRPWM0_CSG2_ISTAT_STPSS_Msk           (0x10UL)                  /*!< HRPWM0_CSG2 ISTAT: STPSS (Bitfield-Mask: 0x01)              */
#define HRPWM0_CSG2_ISTAT_STDS_Pos            (5UL)                     /*!< HRPWM0_CSG2 ISTAT: STDS (Bit 5)                             */
#define HRPWM0_CSG2_ISTAT_STDS_Msk            (0x20UL)                  /*!< HRPWM0_CSG2 ISTAT: STDS (Bitfield-Mask: 0x01)               */
#define HRPWM0_CSG2_ISTAT_CRSS_Pos            (6UL)                     /*!< HRPWM0_CSG2 ISTAT: CRSS (Bit 6)                             */
#define HRPWM0_CSG2_ISTAT_CRSS_Msk            (0x40UL)                  /*!< HRPWM0_CSG2 ISTAT: CRSS (Bitfield-Mask: 0x01)               */
#define HRPWM0_CSG2_ISTAT_CFSS_Pos            (7UL)                     /*!< HRPWM0_CSG2 ISTAT: CFSS (Bit 7)                             */
#define HRPWM0_CSG2_ISTAT_CFSS_Msk            (0x80UL)                  /*!< HRPWM0_CSG2 ISTAT: CFSS (Bitfield-Mask: 0x01)               */
#define HRPWM0_CSG2_ISTAT_CSES_Pos            (8UL)                     /*!< HRPWM0_CSG2 ISTAT: CSES (Bit 8)                             */
#define HRPWM0_CSG2_ISTAT_CSES_Msk            (0x100UL)                 /*!< HRPWM0_CSG2 ISTAT: CSES (Bitfield-Mask: 0x01)               */


/* ================================================================================ */
/* ================       Group 'HRPWM0_HRC' Position & Mask       ================ */
/* ================================================================================ */


/* --------------------------------  HRPWM0_HRC_GC  ------------------------------- */
#define HRPWM0_HRC_GC_HRM0_Pos                (0UL)                     /*!< HRPWM0_HRC GC: HRM0 (Bit 0)                                 */
#define HRPWM0_HRC_GC_HRM0_Msk                (0x3UL)                   /*!< HRPWM0_HRC GC: HRM0 (Bitfield-Mask: 0x03)                   */
#define HRPWM0_HRC_GC_HRM1_Pos                (2UL)                     /*!< HRPWM0_HRC GC: HRM1 (Bit 2)                                 */
#define HRPWM0_HRC_GC_HRM1_Msk                (0xcUL)                   /*!< HRPWM0_HRC GC: HRM1 (Bitfield-Mask: 0x03)                   */
#define HRPWM0_HRC_GC_DTE_Pos                 (8UL)                     /*!< HRPWM0_HRC GC: DTE (Bit 8)                                  */
#define HRPWM0_HRC_GC_DTE_Msk                 (0x100UL)                 /*!< HRPWM0_HRC GC: DTE (Bitfield-Mask: 0x01)                    */
#define HRPWM0_HRC_GC_TR0E_Pos                (9UL)                     /*!< HRPWM0_HRC GC: TR0E (Bit 9)                                 */
#define HRPWM0_HRC_GC_TR0E_Msk                (0x200UL)                 /*!< HRPWM0_HRC GC: TR0E (Bitfield-Mask: 0x01)                   */
#define HRPWM0_HRC_GC_TR1E_Pos                (10UL)                    /*!< HRPWM0_HRC GC: TR1E (Bit 10)                                */
#define HRPWM0_HRC_GC_TR1E_Msk                (0x400UL)                 /*!< HRPWM0_HRC GC: TR1E (Bitfield-Mask: 0x01)                   */
#define HRPWM0_HRC_GC_STC_Pos                 (11UL)                    /*!< HRPWM0_HRC GC: STC (Bit 11)                                 */
#define HRPWM0_HRC_GC_STC_Msk                 (0x800UL)                 /*!< HRPWM0_HRC GC: STC (Bitfield-Mask: 0x01)                    */
#define HRPWM0_HRC_GC_DSTC_Pos                (12UL)                    /*!< HRPWM0_HRC GC: DSTC (Bit 12)                                */
#define HRPWM0_HRC_GC_DSTC_Msk                (0x1000UL)                /*!< HRPWM0_HRC GC: DSTC (Bitfield-Mask: 0x01)                   */
#define HRPWM0_HRC_GC_OCS0_Pos                (13UL)                    /*!< HRPWM0_HRC GC: OCS0 (Bit 13)                                */
#define HRPWM0_HRC_GC_OCS0_Msk                (0x2000UL)                /*!< HRPWM0_HRC GC: OCS0 (Bitfield-Mask: 0x01)                   */
#define HRPWM0_HRC_GC_OCS1_Pos                (14UL)                    /*!< HRPWM0_HRC GC: OCS1 (Bit 14)                                */
#define HRPWM0_HRC_GC_OCS1_Msk                (0x4000UL)                /*!< HRPWM0_HRC GC: OCS1 (Bitfield-Mask: 0x01)                   */
#define HRPWM0_HRC_GC_DTUS_Pos                (16UL)                    /*!< HRPWM0_HRC GC: DTUS (Bit 16)                                */
#define HRPWM0_HRC_GC_DTUS_Msk                (0x10000UL)               /*!< HRPWM0_HRC GC: DTUS (Bitfield-Mask: 0x01)                   */

/* --------------------------------  HRPWM0_HRC_PL  ------------------------------- */
#define HRPWM0_HRC_PL_PSL0_Pos                (0UL)                     /*!< HRPWM0_HRC PL: PSL0 (Bit 0)                                 */
#define HRPWM0_HRC_PL_PSL0_Msk                (0x1UL)                   /*!< HRPWM0_HRC PL: PSL0 (Bitfield-Mask: 0x01)                   */
#define HRPWM0_HRC_PL_PSL1_Pos                (1UL)                     /*!< HRPWM0_HRC PL: PSL1 (Bit 1)                                 */
#define HRPWM0_HRC_PL_PSL1_Msk                (0x2UL)                   /*!< HRPWM0_HRC PL: PSL1 (Bitfield-Mask: 0x01)                   */

/* -------------------------------  HRPWM0_HRC_GSEL  ------------------------------ */
#define HRPWM0_HRC_GSEL_C0SS_Pos              (0UL)                     /*!< HRPWM0_HRC GSEL: C0SS (Bit 0)                               */
#define HRPWM0_HRC_GSEL_C0SS_Msk              (0x7UL)                   /*!< HRPWM0_HRC GSEL: C0SS (Bitfield-Mask: 0x07)                 */
#define HRPWM0_HRC_GSEL_C0CS_Pos              (3UL)                     /*!< HRPWM0_HRC GSEL: C0CS (Bit 3)                               */
#define HRPWM0_HRC_GSEL_C0CS_Msk              (0x38UL)                  /*!< HRPWM0_HRC GSEL: C0CS (Bitfield-Mask: 0x07)                 */
#define HRPWM0_HRC_GSEL_S0M_Pos               (6UL)                     /*!< HRPWM0_HRC GSEL: S0M (Bit 6)                                */
#define HRPWM0_HRC_GSEL_S0M_Msk               (0xc0UL)                  /*!< HRPWM0_HRC GSEL: S0M (Bitfield-Mask: 0x03)                  */
#define HRPWM0_HRC_GSEL_C0M_Pos               (8UL)                     /*!< HRPWM0_HRC GSEL: C0M (Bit 8)                                */
#define HRPWM0_HRC_GSEL_C0M_Msk               (0x300UL)                 /*!< HRPWM0_HRC GSEL: C0M (Bitfield-Mask: 0x03)                  */
#define HRPWM0_HRC_GSEL_S0ES_Pos              (10UL)                    /*!< HRPWM0_HRC GSEL: S0ES (Bit 10)                              */
#define HRPWM0_HRC_GSEL_S0ES_Msk              (0xc00UL)                 /*!< HRPWM0_HRC GSEL: S0ES (Bitfield-Mask: 0x03)                 */
#define HRPWM0_HRC_GSEL_C0ES_Pos              (12UL)                    /*!< HRPWM0_HRC GSEL: C0ES (Bit 12)                              */
#define HRPWM0_HRC_GSEL_C0ES_Msk              (0x3000UL)                /*!< HRPWM0_HRC GSEL: C0ES (Bitfield-Mask: 0x03)                 */
#define HRPWM0_HRC_GSEL_C1SS_Pos              (16UL)                    /*!< HRPWM0_HRC GSEL: C1SS (Bit 16)                              */
#define HRPWM0_HRC_GSEL_C1SS_Msk              (0x70000UL)               /*!< HRPWM0_HRC GSEL: C1SS (Bitfield-Mask: 0x07)                 */
#define HRPWM0_HRC_GSEL_C1CS_Pos              (19UL)                    /*!< HRPWM0_HRC GSEL: C1CS (Bit 19)                              */
#define HRPWM0_HRC_GSEL_C1CS_Msk              (0x380000UL)              /*!< HRPWM0_HRC GSEL: C1CS (Bitfield-Mask: 0x07)                 */
#define HRPWM0_HRC_GSEL_S1M_Pos               (22UL)                    /*!< HRPWM0_HRC GSEL: S1M (Bit 22)                               */
#define HRPWM0_HRC_GSEL_S1M_Msk               (0xc00000UL)              /*!< HRPWM0_HRC GSEL: S1M (Bitfield-Mask: 0x03)                  */
#define HRPWM0_HRC_GSEL_C1M_Pos               (24UL)                    /*!< HRPWM0_HRC GSEL: C1M (Bit 24)                               */
#define HRPWM0_HRC_GSEL_C1M_Msk               (0x3000000UL)             /*!< HRPWM0_HRC GSEL: C1M (Bitfield-Mask: 0x03)                  */
#define HRPWM0_HRC_GSEL_S1ES_Pos              (26UL)                    /*!< HRPWM0_HRC GSEL: S1ES (Bit 26)                              */
#define HRPWM0_HRC_GSEL_S1ES_Msk              (0xc000000UL)             /*!< HRPWM0_HRC GSEL: S1ES (Bitfield-Mask: 0x03)                 */
#define HRPWM0_HRC_GSEL_C1ES_Pos              (28UL)                    /*!< HRPWM0_HRC GSEL: C1ES (Bit 28)                              */
#define HRPWM0_HRC_GSEL_C1ES_Msk              (0x30000000UL)            /*!< HRPWM0_HRC GSEL: C1ES (Bitfield-Mask: 0x03)                 */

/* -------------------------------  HRPWM0_HRC_TSEL  ------------------------------ */
#define HRPWM0_HRC_TSEL_TSEL0_Pos             (0UL)                     /*!< HRPWM0_HRC TSEL: TSEL0 (Bit 0)                              */
#define HRPWM0_HRC_TSEL_TSEL0_Msk             (0x7UL)                   /*!< HRPWM0_HRC TSEL: TSEL0 (Bitfield-Mask: 0x07)                */
#define HRPWM0_HRC_TSEL_TSEL1_Pos             (3UL)                     /*!< HRPWM0_HRC TSEL: TSEL1 (Bit 3)                              */
#define HRPWM0_HRC_TSEL_TSEL1_Msk             (0x38UL)                  /*!< HRPWM0_HRC TSEL: TSEL1 (Bitfield-Mask: 0x07)                */
#define HRPWM0_HRC_TSEL_TS0E_Pos              (16UL)                    /*!< HRPWM0_HRC TSEL: TS0E (Bit 16)                              */
#define HRPWM0_HRC_TSEL_TS0E_Msk              (0x10000UL)               /*!< HRPWM0_HRC TSEL: TS0E (Bitfield-Mask: 0x01)                 */
#define HRPWM0_HRC_TSEL_TS1E_Pos              (17UL)                    /*!< HRPWM0_HRC TSEL: TS1E (Bit 17)                              */
#define HRPWM0_HRC_TSEL_TS1E_Msk              (0x20000UL)               /*!< HRPWM0_HRC TSEL: TS1E (Bitfield-Mask: 0x01)                 */

/* --------------------------------  HRPWM0_HRC_SC  ------------------------------- */
#define HRPWM0_HRC_SC_ST_Pos                  (0UL)                     /*!< HRPWM0_HRC SC: ST (Bit 0)                                   */
#define HRPWM0_HRC_SC_ST_Msk                  (0x1UL)                   /*!< HRPWM0_HRC SC: ST (Bitfield-Mask: 0x01)                     */

/* -------------------------------  HRPWM0_HRC_DCR  ------------------------------- */
#define HRPWM0_HRC_DCR_DTRV_Pos               (0UL)                     /*!< HRPWM0_HRC DCR: DTRV (Bit 0)                                */
#define HRPWM0_HRC_DCR_DTRV_Msk               (0xffffUL)                /*!< HRPWM0_HRC DCR: DTRV (Bitfield-Mask: 0xffff)                */

